In [51]:
import  pandas as pd

In [52]:
file = '../DATA/employees.csv'
df = pd.read_csv(file)
df.head()

  First Name  Gender Start Date    Salary   Mgmt       Team
0    Douglas    Male     8/6/93       NaN   True  Marketing
1     Thomas    Male    3/31/96   61933.0   True        NaN
2      Maria  Female        NaN  130590.0  False    Finance
3      Jerry     NaN     3/4/05  138705.0   True    Finance
4      Larry    Male    1/24/98  101004.0   True         IT

In [53]:
df.shape

(1001, 6)

In [54]:
employees = df

In [55]:
employees['Mgmt'].astype(bool)

0        True
1        True
2       False
3        True
4        True
        ...
996     False
997     False
998     False
999      True
1000     True
Name: Mgmt, Length: 1001, dtype: bool

In [56]:
# change Mgmt type into bool
employees['Mgmt'] = employees['Mgmt'].astype(bool)

In [57]:
# change na in salary into 0
employees['Salary'] = employees['Salary'].fillna(0).astype('int')

In [58]:
employees.tail(4)

     First Name Gender Start Date  Salary   Mgmt          Team
997     Russell   Male    5/20/13   96914  False       Product
998       Larry   Male    4/20/13   60500  False  Business Dev
999      Albert   Male    5/15/12  129949   True         Sales
1000        NaN    NaN        NaN       0   True           NaN

In [59]:
# change Gender column dtype as category
employees['Gender'] = employees['Gender'].astype('category')

In [60]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    object
 3   Salary      1001 non-null   int32
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    object
dtypes: bool(1), category(1), int32(1), object(3)
memory usage: 29.6+ KB

In [61]:
# change team col into category dtype
employees['Team'] = employees['Team'].astype('category')

In [62]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    category
 2   Start Date  999 non-null    object
 3   Salary      1001 non-null   int32
 4   Mgmt        1001 non-null   bool
 5   Team        957 non-null    category
dtypes: bool(1), category(2), int32(1), object(2)
memory usage: 23.1+ KB

In [63]:
# get people who's  First name is Maria
employees[employees['First Name'] == 'Maria']

    First Name  Gender Start Date  Salary   Mgmt          Team
2        Maria  Female        NaN  130590  False       Finance
198      Maria  Female   12/27/90   36067   True       Product
815      Maria     NaN    1/18/86  106562  False            HR
844      Maria     NaN    6/19/85  148857  False         Legal
936      Maria  Female    3/14/03   96250  False  Business Dev
984      Maria  Female   10/15/11   43455  False   Engineering

In [64]:
# save only condition which find Maria in First Name
employees_maria = employees['First Name'] == 'Maria'

In [65]:
# find data using employees_maria
employees[employees_maria]

    First Name  Gender Start Date  Salary   Mgmt          Team
2        Maria  Female        NaN  130590  False       Finance
198      Maria  Female   12/27/90   36067   True       Product
815      Maria     NaN    1/18/86  106562  False            HR
844      Maria     NaN    6/19/85  148857  False         Legal
936      Maria  Female    3/14/03   96250  False  Business Dev
984      Maria  Female   10/15/11   43455  False   Engineering

In [66]:
# list all people who's job is not Finance
employees[employees['Team'] != 'Finance']

     First Name  Gender Start Date  Salary   Mgmt          Team
0       Douglas    Male     8/6/93       0   True     Marketing
1        Thomas    Male    3/31/96   61933   True           NaN
4         Larry    Male    1/24/98  101004   True            IT
5        Dennis    Male    4/18/87  115163  False         Legal
6          Ruby  Female    8/17/87   65476   True       Product
...         ...     ...        ...     ...    ...           ...
995       Henry     NaN   11/23/14  132483  False  Distribution
997     Russell    Male    5/20/13   96914  False       Product
998       Larry    Male    4/20/13   60500  False  Business Dev
999      Albert    Male    5/15/12  129949   True         Sales
1000        NaN     NaN        NaN       0   True           NaN

[899 rows x 6 columns]

In [67]:
# find poeple who's Mgmt is True
employees[employees['Mgmt'] == True]

     First Name  Gender Start Date  Salary  Mgmt         Team
0       Douglas    Male     8/6/93       0  True    Marketing
1        Thomas    Male    3/31/96   61933  True          NaN
3         Jerry     NaN     3/4/05  138705  True      Finance
4         Larry    Male    1/24/98  101004  True           IT
6          Ruby  Female    8/17/87   65476  True      Product
...         ...     ...        ...     ...   ...          ...
992     Anthony    Male   10/16/11  112769  True      Finance
993        Tina  Female    5/15/97   56450  True  Engineering
994      George    Male    6/21/13   98874  True    Marketing
999      Albert    Male    5/15/12  129949  True        Sales
1000        NaN     NaN        NaN       0  True          NaN

[536 rows x 6 columns]

In [68]:
# save mark condition only which find Salary is more than 100000
employees_salary_mark = employees['Salary'] > 100000
employees_salary_mark.head()

0    False
1    False
2     True
3     True
4     True
Name: Salary, dtype: bool

In [69]:
# find people who's Gender is female and belong to Business Dev team 

employees[
    (employees['Gender'] == 'Female') &
    (employees['Team'] == 'Business Dev')
]

# save two condition into separate mask variable
gender_mask = employees['Gender'] == 'Female'
team_mask = employees['Team'] == 'Business Dev'

# make above two condition to find people
employees[gender_mask & team_mask]

    First Name  Gender Start Date  Salary   Mgmt          Team
9      Frances  Female     8/8/02  139852   True  Business Dev
33        Jean  Female   12/18/93  119082  False  Business Dev
36      Rachel  Female    2/16/09  142032  False  Business Dev
38   Stephanie  Female    9/13/86   36844   True  Business Dev
61      Denise  Female    11/6/01  106862  False  Business Dev
66       Nancy  Female   12/15/12  125250   True  Business Dev
92       Linda  Female    5/25/00  119009   True  Business Dev
111     Bonnie  Female   12/17/99   42153   True  Business Dev
114     Ashley  Female     8/4/02   58698   True  Business Dev
118     Andrea  Female    1/12/12  120204  False  Business Dev
134    Carolyn  Female     4/9/11  109260   True  Business Dev
155      Marie  Female    3/16/03  104058   True  Business Dev
164       Mary  Female    8/13/99  134645  False  Business Dev
182    Lillian  Female    6/19/99  123940   True  Business Dev
203      Diana  Female     1/4/13  103521   True  Business Dev
249      Betty  Female    6/12/02  104896   True  Business Dev
275      Debra  Female    2/22/94  104250   True  Business Dev
279       Ruby  Female    11/8/00  105946  False  Business Dev
317      Kathy  Female   12/18/13  132381  False  Business Dev
324       Ruby  Female   12/10/88   76707  False  Business Dev
368    Marilyn  Female   12/17/82  147183  False  Business Dev
370      Linda  Female    7/15/09  144001  False  Business Dev
401      Norma  Female    4/16/96   38872   True  Business Dev
406       Mary  Female    8/22/10   42214   True  Business Dev
419    Dorothy  Female    11/5/13  140136   True  Business Dev
441     Louise  Female    5/13/03   46666   True  Business Dev
481        NaN  Female    4/27/13   93847   True  Business Dev
487     Cheryl  Female    12/3/14   71751  False  Business Dev
498      Diana  Female    6/13/94   41831  False  Business Dev
509        Ann  Female    11/4/84   90719  False  Business Dev
537    Cynthia  Female    9/14/91   51633   True  Business Dev
583      Diane  Female     2/2/88   49501  False  Business Dev
590     Andrea  Female   10/30/94   87575   True  Business Dev
638    Frances  Female   11/12/96  112467  False  Business Dev
735    Barbara  Female   11/26/02   82884   True  Business Dev
746     Gloria  Female    8/19/04   46602   True  Business Dev
748     Martha  Female    7/17/97   94963   True  Business Dev
772    Lillian  Female    8/14/09  113554   True  Business Dev
779      Doris  Female     9/8/84  114360   True  Business Dev
802       Jane  Female    1/12/92   51923  False  Business Dev
822    Deborah  Female    2/26/09  118043   True  Business Dev
841       Ruby  Female    8/13/06   48354  False  Business Dev
852      Diana  Female   11/19/04  105066   True  Business Dev
859      Robin  Female    10/1/12   41808  False  Business Dev
872     Brenda  Female    1/18/15   73749  False  Business Dev
898       Jane  Female    4/27/12   59680   True  Business Dev
916    Marilyn  Female    1/16/96  118369   True  Business Dev
933      Doris  Female     7/5/93  141439  False  Business Dev
936      Maria  Female    3/14/03   96250  False  Business Dev
950      Paula  Female    5/21/83   58423  False  Business Dev

In [70]:
# make condition to get the Mgmt True
mgmt_mask = employees['Mgmt'] == True

# make above three conditions to get people
employees[gender_mask & team_mask & mgmt_mask]

    First Name  Gender Start Date  Salary  Mgmt          Team
9      Frances  Female     8/8/02  139852  True  Business Dev
38   Stephanie  Female    9/13/86   36844  True  Business Dev
66       Nancy  Female   12/15/12  125250  True  Business Dev
92       Linda  Female    5/25/00  119009  True  Business Dev
111     Bonnie  Female   12/17/99   42153  True  Business Dev
114     Ashley  Female     8/4/02   58698  True  Business Dev
134    Carolyn  Female     4/9/11  109260  True  Business Dev
155      Marie  Female    3/16/03  104058  True  Business Dev
182    Lillian  Female    6/19/99  123940  True  Business Dev
203      Diana  Female     1/4/13  103521  True  Business Dev
249      Betty  Female    6/12/02  104896  True  Business Dev
275      Debra  Female    2/22/94  104250  True  Business Dev
401      Norma  Female    4/16/96   38872  True  Business Dev
406       Mary  Female    8/22/10   42214  True  Business Dev
419    Dorothy  Female    11/5/13  140136  True  Business Dev
441     Louise  Female    5/13/03   46666  True  Business Dev
481        NaN  Female    4/27/13   93847  True  Business Dev
537    Cynthia  Female    9/14/91   51633  True  Business Dev
590     Andrea  Female   10/30/94   87575  True  Business Dev
735    Barbara  Female   11/26/02   82884  True  Business Dev
746     Gloria  Female    8/19/04   46602  True  Business Dev
748     Martha  Female    7/17/97   94963  True  Business Dev
772    Lillian  Female    8/14/09  113554  True  Business Dev
779      Doris  Female     9/8/84  114360  True  Business Dev
822    Deborah  Female    2/26/09  118043  True  Business Dev
852      Diana  Female   11/19/04  105066  True  Business Dev
898       Jane  Female    4/27/12   59680  True  Business Dev
916    Marilyn  Female    1/16/96  118369  True  Business Dev

In [71]:
# make Start Date column as datetime dtype
employees['Start Date'] = pd.to_datetime(employees['Start Date'])

C:\Users\Administrator\AppData\Local\Temp\ipykernel_31820\2123131305.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  employees['Start Date'] = pd.to_datetime(employees['Start Date'])

In [72]:
# make condition variables (1) Salary is lower then 40000 (2) start date is higher than '2015-01-01'

salary_mask = employees['Salary'] < 40000
start_date_mask = employees['Start Date'] > pd.to_datetime('2015-01-01')


# make above two conditions to get people as or operator
employees[salary_mask | start_date_mask]

     First Name  Gender Start Date  Salary   Mgmt         Team
0       Douglas    Male 1993-08-06       0   True    Marketing
7           NaN  Female 2015-07-20   45906   True      Finance
15      Lillian  Female 2016-06-05   59414  False      Product
25          NaN    Male 2012-10-08   37076   True           IT
26        Craig    Male 2000-02-27   37598   True    Marketing
...         ...     ...        ...     ...    ...          ...
958      Gloria  Female 1987-10-24   39833  False  Engineering
964       Bruce    Male 1980-05-07   35802   True        Sales
967      Thomas    Male 2016-03-12  105681  False  Engineering
989      Justin     NaN 1991-02-10   38344  False        Legal
1000        NaN     NaN        NaT       0   True          NaN

[83 rows x 6 columns]

In [73]:
# make a condition variable which find people who's Salary is lower than 100000

salary_mask = employees['Salary'] < 100000


# make above condition to get people
employees[salary_mask]

     First Name  Gender Start Date  Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       0   True     Marketing
1        Thomas    Male 1996-03-31   61933   True           NaN
6          Ruby  Female 1987-08-17   65476   True       Product
7           NaN  Female 2015-07-20   45906   True       Finance
8        Angela  Female 2005-11-22   95570   True   Engineering
...         ...     ...        ...     ...    ...           ...
994      George    Male 2013-06-21   98874   True     Marketing
996     Phillip    Male 1984-01-31   42392  False       Finance
997     Russell    Male 2013-05-20   96914  False       Product
998       Larry    Male 2013-04-20   60500  False  Business Dev
1000        NaN     NaN        NaT       0   True           NaN

[592 rows x 6 columns]

In [74]:
# make a condition variable which find people who's Salary is higher than 100000 using salary_mask

employees[~salary_mask]

# conert above ~salary_mask to salary_mask_inverse and express in another way

salary_mask_inverse = employees['Salary'] >= 100000


employees[salary_mask_inverse]

employees["Team"].eq('Marketing')
employees["Team"].ne('Marketing')

0       False
1        True
2        True
3        True
4        True
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

In [75]:
# get people who is in Sales Legal and Marketing team

team_mask = employees["Team"].isin(["Sales", "Legal", "Marketing"])

# another method by not using isin

employees[team_mask]

    First Name  Gender Start Date  Salary   Mgmt       Team
0      Douglas    Male 1993-08-06       0   True  Marketing
5       Dennis    Male 1987-04-18  115163  False      Legal
11       Julie  Female 1997-10-26  102508   True      Legal
13        Gary    Male 2008-01-27  109831  False      Sales
20        Lois     NaN 1995-04-22   64714   True      Legal
..         ...     ...        ...     ...    ...        ...
986      Donna  Female 1982-11-26   82871  False  Marketing
989     Justin     NaN 1991-02-10   38344  False      Legal
991       Rose  Female 2002-08-25  134505   True  Marketing
994     George    Male 2013-06-21   98874   True  Marketing
999     Albert    Male 2012-05-15  129949   True      Sales

[280 rows x 6 columns]

In [76]:
# get people whose Salary is ge 80000 and lt 90000

salary_mask = (employees['Salary'] >= 80000) & (employees['Salary'] < 90000)

employees[salary_mask]

    First Name  Gender Start Date  Salary   Mgmt         Team
19       Donna  Female 2010-07-22   81014  False      Product
31       Joyce     NaN 2005-02-20   88657  False      Product
35     Theresa  Female 2006-10-10   85182  False        Sales
45       Roger    Male 1980-04-17   88010   True        Sales
54        Sara  Female 2007-08-15   83677  False  Engineering
..         ...     ...        ...     ...    ...          ...
930      Nancy  Female 2001-09-10   85213   True    Marketing
956    Beverly  Female 1986-10-17   80838  False  Engineering
963        Ann  Female 1994-09-23   89443   True        Sales
985    Stephen     NaN 1983-07-10   85668  False        Legal
986      Donna  Female 1982-11-26   82871  False    Marketing

[94 rows x 6 columns]

In [77]:

# make salary_mask to use between method
salary_mask_alternative = employees['Salary'].between(80000, 90000, inclusive='left')


employees[salary_mask_alternative]

    First Name  Gender Start Date  Salary   Mgmt         Team
19       Donna  Female 2010-07-22   81014  False      Product
31       Joyce     NaN 2005-02-20   88657  False      Product
35     Theresa  Female 2006-10-10   85182  False        Sales
45       Roger    Male 1980-04-17   88010   True        Sales
54        Sara  Female 2007-08-15   83677  False  Engineering
..         ...     ...        ...     ...    ...          ...
930      Nancy  Female 2001-09-10   85213   True    Marketing
956    Beverly  Female 1986-10-17   80838  False  Engineering
963        Ann  Female 1994-09-23   89443   True        Sales
985    Stephen     NaN 1983-07-10   85668  False        Legal
986      Donna  Female 1982-11-26   82871  False    Marketing

[94 rows x 6 columns]

In [78]:
# find null in Gender

employees['Gender'].isnull().sum()

147

In [79]:
# find not null in Gender

employees['Gender'].notnull().sum()

854

In [80]:
# drop data by only considering Gender and inplace as true


employees.dropna(subset=['Gender'])

    First Name  Gender Start Date  Salary   Mgmt          Team
0      Douglas    Male 1993-08-06       0   True     Marketing
1       Thomas    Male 1996-03-31   61933   True           NaN
2        Maria  Female        NaT  130590  False       Finance
4        Larry    Male 1998-01-24  101004   True            IT
5       Dennis    Male 1987-04-18  115163  False         Legal
..         ...     ...        ...     ...    ...           ...
994     George    Male 2013-06-21   98874   True     Marketing
996    Phillip    Male 1984-01-31   42392  False       Finance
997    Russell    Male 2013-05-20   96914  False       Product
998      Larry    Male 2013-04-20   60500  False  Business Dev
999     Albert    Male 2012-05-15  129949   True         Sales

[854 rows x 6 columns]

In [81]:
# drop the data which row is all filled with null

employees.dropna(how='all')

     First Name  Gender Start Date  Salary   Mgmt          Team
0       Douglas    Male 1993-08-06       0   True     Marketing
1        Thomas    Male 1996-03-31   61933   True           NaN
2         Maria  Female        NaT  130590  False       Finance
3         Jerry     NaN 2005-03-04  138705   True       Finance
4         Larry    Male 1998-01-24  101004   True            IT
...         ...     ...        ...     ...    ...           ...
996     Phillip    Male 1984-01-31   42392  False       Finance
997     Russell    Male 2013-05-20   96914  False       Product
998       Larry    Male 2013-04-20   60500  False  Business Dev
999      Albert    Male 2012-05-15  129949   True         Sales
1000        NaN     NaN        NaT       0   True           NaN

[1001 rows x 6 columns]

In [82]:
# get unduplicated data in gender

employees['Gender'].drop_duplicates()

0      Male
2    Female
3       NaN
Name: Gender, dtype: category
Categories (2, object): ['Female', 'Male']

In [83]:
# get unduplicated data in Team

employees['Team'].drop_duplicates()

0        Marketing
1              NaN
2          Finance
4               IT
5            Legal
6          Product
8      Engineering
9     Business Dev
12              HR
13           Sales
40    Distribution
Name: Team, dtype: category
Categories (10, object): ['Business Dev', 'Distribution', 'Engineering', 'Finance', ..., 'Legal', 'Marketing', 'Product', 'Sales']

In [84]:
# get true or false about duplicated data in Team

employees['Team'].duplicated()

0       False
1       False
2       False
3        True
4       False
        ...
996      True
997      True
998      True
999      True
1000     True
Name: Team, Length: 1001, dtype: bool

In [85]:
file_netflix = '../DATA/netflix.csv'

netflix_raw_data = pd.read_csv(file_netflix)

In [87]:
netflix_raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   object
 3   type        5837 non-null   object
dtypes: object(4)
memory usage: 182.5+ KB

In [89]:
# set type col as category

netflix_raw_data['type'] = netflix_raw_data['type'].astype('category')
# set date_added as datetime dtype

netflix_raw_data['date_added'] = pd.to_datetime(netflix_raw_data['date_added'])
# set director as category dtype

netflix_raw_data['director'] = netflix_raw_data['director'].astype('category')

netflix_raw_data

                      title        director date_added     type
0               Alias Grace             NaN 2017-11-03  TV Show
1            A Patch of Fog  Michael Lennox 2017-04-15    Movie
2                  Lunatics             NaN 2019-04-19  TV Show
3                 Uriyadi 2     Vijay Kumar 2019-08-02    Movie
4         Shrek the Musical     Jason Moore 2013-12-29    Movie
...                     ...             ...        ...      ...
5832            The Pursuit     John Papola 2019-08-07    Movie
5833       Hurricane Bianca   Matt Kugelman 2017-01-01    Movie
5834           Amar's Hands  Khaled Youssef 2019-04-26    Movie
5835  Bill Nye: Science Guy  Jason Sussberg 2018-04-25    Movie
5836           Age of Glory             NaN        NaT  TV Show

[5837 rows x 4 columns]

In [92]:
# find all rows which title is Limitless

netflix_raw_data[netflix_raw_data['title'] == 'Limitless']

          title         director date_added     type
1559  Limitless      Neil Burger 2019-05-16    Movie
2564  Limitless              NaN 2016-07-01  TV Show
4579  Limitless  Vrinda Samartha 2019-10-01    Movie

In [94]:
# get all rows which director is robert rodriguez and movie type is Movie

netflix_raw_data[(netflix_raw_data['director'] == 'Robert Rodriguez') & (netflix_raw_data['type'] == 'Movie')]

,title,director,date_added,type
1384,Spy Kids: All the Time in the World,Robert Rodriguez,2019-02-19,Movie
1416,Spy Kids 3: Game Over,Robert Rodriguez,2019-04-01,Movie
1460,Spy Kids 2: The Island of Lost Dreams,Robert Rodriguez,2019-03-08,Movie
2890,Sin City,Robert Rodriguez,2019-10-01,Movie
3836,Shorts,Robert Rodriguez,2019-07-01,Movie
3883,Spy Kids,Robert Rodriguez,2019-04-01,Movie

In [95]:
# fimd all rows in following condition 1. date_added = 2019-07-31 2. director = Robert Altman 3. use or condition only

netflix_raw_data[(netflix_raw_data['date_added'] == pd.to_datetime('2019-07-31')) | (netflix_raw_data['director'] == 'Robert Altman')]

                                title       director date_added     type
611                            Popeye  Robert Altman 2019-11-24    Movie
1028        The Red Sea Diving Resort    Gideon Raff 2019-07-31    Movie
1092                     Gosford Park  Robert Altman 2019-11-01    Movie
3473  Bangkok Love Stories: Innocence            NaN 2019-07-31  TV Show
5117                       Ramen Shop      Eric Khoo 2019-07-31    Movie

In [96]:
# find all rows (1) director = Orson Welles or Aditya Kripalani or Sam Raimi

netflix_raw_data[netflix_raw_data['director'].isin(['Orson Welles', 'Aditya Kripalani', 'Sam Raimi'])]

                           title          director date_added   type
946                 The Stranger      Orson Welles 2018-07-19  Movie
1870                    The Gift         Sam Raimi 2019-11-20  Movie
3706                Spider-Man 3         Sam Raimi 2019-11-01  Movie
4243        Tikli and Laxmi Bomb  Aditya Kripalani 2018-08-01  Movie
4475  The Other Side of the Wind      Orson Welles 2018-11-02  Movie
5115    Tottaa Pataaka Item Maal  Aditya Kripalani 2019-06-25  Movie

In [100]:
# find all movie which is added between 2019-05-01 and 2019-06-01
netflix_raw_data[netflix_raw_data["date_added"].between(pd.to_datetime('2019-05-01'), pd.to_datetime('2019-06-01'))]

,title,director,date_added,type
29,Chopsticks,Sachin Yardi,2019-05-31,Movie
60,Away From Home,NaN,2019-05-08,TV Show
82,III Smoking Barrels,Sanjib Dey,2019-06-01,Movie
108,Jailbirds,NaN,2019-05-10,TV Show
124,Pegasus,Han Han,2019-05-31,Movie
...,...,...,...,...
5671,Satan & Adam,V. Scott Balcerek,2019-06-01,Movie
5675,Rim of the World,McG,2019-05-24,Movie
5677,Malibu Rescue,Savage Steve Holland,2019-05-13,Movie
5739,Mission Istaanbul: Darr Ke Aagey Jeet Hai,Apoorva Lakhia,2019-05-16,Movie
5829,The Kindness Diaries,NaN,2019-05-01,TV Show

In [101]:
netflix_raw_data.dropna(subset=['director'])

                                   title        director date_added   type
1                         A Patch of Fog  Michael Lennox 2017-04-15  Movie
3                              Uriyadi 2     Vijay Kumar 2019-08-02  Movie
4                      Shrek the Musical     Jason Moore 2013-12-29  Movie
5                       Schubert In Love     Lars Büchel 2018-03-01  Movie
6     We Have Always Lived in the Castle   Stacie Passon 2019-09-14  Movie
...                                  ...             ...        ...    ...
5830                         Bibi & Tina     Detlev Buck 2017-04-15  Movie
5832                         The Pursuit     John Papola 2019-08-07  Movie
5833                    Hurricane Bianca   Matt Kugelman 2017-01-01  Movie
5834                        Amar's Hands  Khaled Youssef 2019-04-26  Movie
5835               Bill Nye: Science Guy  Jason Sussberg 2018-04-25  Movie

[3936 rows x 4 columns]

In [107]:
# find the movie which is the only one movie on date_added

netflix_raw_data[~(netflix_raw_data['date_added'].duplicated(keep=False)) & (netflix_raw_data['type'] == 'Movie')]

,title,director,date_added,type
4,Shrek the Musical,Jason Moore,2013-12-29,Movie
12,Without Gorky,Cosima Spender,2017-05-31,Movie
30,Anjelah Johnson: Not Fancy,Jay Karas,2015-10-02,Movie
38,One Last Thing,Tim Rouhana,2019-08-25,Movie
70,Marvel's Iron Man & Hulk: Heroes United,Leo Riley,2014-02-16,Movie
...,...,...,...,...
5748,Menorca,John Barnard,2017-08-27,Movie
5749,Green Room,Jeremy Saulnier,2018-11-12,Movie
5788,Chris Brown: Welcome to My Life,Andrew Sandler,2017-10-07,Movie
5789,A Very Murray Christmas,Sofia Coppola,2015-12-04,Movie
5812,Little Singham in London,Prakash Satam,2019-04-22,Movie